<script setup></script>

<template>
  <header class="lg:flex bg-gradient-to-r from-cyan-500 to-blue-500 justify-between px-32 py-2">
    <h1 class="text-2xl">Наша история🥰</h1>
    <nav>
      <ul class="md:flex text-white gap-10">
        <li class="md-1"><a href="#11_class " class="btn">11-класс</a></li>
        <li class="md-2"><a href="#young " class="btn">Детство</a></li>
        <li class="md-2"><a href="#wolf " class="btn">Волченок</a></li>
        <li class="md-2"><a href="#riddle " class="btn">Загадка</a></li>
        <li class="md-2"><a href="#birthday " class="btn">Загадка</a></li>
      </ul>
    </nav>
  </header>
  <section id="11_class" class="bg-[url('/public/fone_1.jpg')] min-h-min">
    <div class="lg:flex justify-center gap-10 p-20">
      <img src="/public/11class.jpg" alt="" class="lg:w-2/5 rounded m-auto" />
      <p class="p-5 bg-gray-200/50 mt-10 lg:ml-10 lg:mt-0 rounded text-justify">
        Выпускница 11 класса. Лчшая в своем классе, самый лучший и толантливый человек изображен на
        этом фото. Много завистников могли бы оспаривать это, но не поверить в то что это девочка
        самая лучшая и красивая просто невозможно. Множество раз она была ведущей и самым популярным
        человеком в своем классе. Непревзойденный лидер, вела всех к успеху и показывала личный
        пример. Множество раз доказывая всем остальним, что лучше нее нету никого. 100 бальница по
        русскому языку, набравшая много баллов и получив золотую медаль, у нее была мечта стать
        стоматологом ставя в пример свою любимую и самую лучшую на свете маму ❤.
      </p>
    </div>
  </section>
  <section id="young" class="bg-[url('/public/fone_2.jpg')] h-screen">
    <div class="lg:flex justify-center gap-10 p-20">
      <img src="/public/mam.jpg" alt="" class="lg:w-2/5 rounded m-auto" />
      <p class="p-5 bg-gray-200/50 mt-10 lg:ml-10 lg:mt-0 rounded text-justify">
        Будучи самой счастливой, радостной, умной и красивой с самого детства, все равно старается
        на благо общества, заполучая сложную и приэтом очень важную профессию. Работая над собой в
        настоящее время для того чтобы всю жизнь помогать другим, несомненно является гордостью для
        своих родителей.
      </p>
    </div>
  </section>
  <section id="wolf" class="bg-[url('/public/fone_3.jpg')] h-screen">
    <div class="lg:flex justify-center gap-10 p-20">
      <img src="/public/wolf.jpg" alt="" class="lg:w-2/5 rounded m-auto" />
      <p class="p-5 bg-gray-200/50 mt-10 lg:ml-10 lg:mt-0 rounded text-justify">
        Начитанная с самого детства будет всегда являться для всех идеалом воспитанности и
        интелегентности. Благородная и бесстрашная ка ни крути.
      </p>
    </div>
  </section>
  <section id="riddle" class="bg-[url('/public/fone_4.jpg')] h-screen">
    <div class="lg:flex justify-center gap-10 p-20">
      <img src="/public/you.jpg" alt="" class="lg:w-2/5 rounded m-auto" />
      <p class="p-5 bg-gray-200/50 mt-10 lg:ml-10 lg:mt-0 rounded text-justify">
        В общем о тебе можно говрит вечно, и что бы ты про меня не думала и не говорила, я всегда
        буду тебя любить и делать все для того чтобы ты была счастлива. Моя маленькая, рыженьккая,
        красивенькая и непревзойденная Маруся.
      </p>
    </div>
  </section>
  <section id="birthday" class="bg-[url('/public/fone_5.jpg')] h-screen">
    <div class="lg:flex justify-center gap-10 p-20">
      <img src="/public/birthday.jpg" alt="" class="lg:w-2/5 rounded m-auto" />
      <p class="p-5 bg-gray-200/50 mt-10 lg:ml-10 lg:mt-0 rounded text-justify">
        С днем рождения тебя, я желаю тебе всего наилучшего и чтобы у тебя в жизни все было хорошо, с праздником любимая!😘
      </p>
    </div>
  </section>
</template>

<style scoped>
.btn {
  background: rgb(211, 42, 144);
  border-radius: 0.25rem;
  padding: 0.25rem;
  transition: all ease 0.5s;
}
.btn:hover {
  background: rgb(210, 64, 151);
}
</style>
